Revit 2024 API
AssemblyMemberDifferentCategory.CategoryId1 Property
 Category id of the first assembly member
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public ElementId CategoryId1 { get; }
Visual Basic
Public ReadOnly Property CategoryId1 As ElementId
	Get
Visual C++
public:
property ElementId^ CategoryId1 {
	ElementId^ get ();
}
See Also
AssemblyMemberDifferentCategory Class
Autodesk.Revit.DB Namespace